package com.example.articlestest.data.model

import com.example.articlestest.R


object DemoDataProvider {

    val article = Article(
        id = 1,
        title = "Добрый вечер",
        author = "Полля Рыжова",
        date = "17/08/22",
        imageId = R.drawable.food1
    )

    val articleList = listOf(
        article,
        article.copy(
            id = 2,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food16
        ),
        article.copy(
            id = 3,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.p2
        ),
        article.copy(
            id = 4,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.p3,
        ),
        article.copy(
            id = 5,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 6,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 7,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 8,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 9,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 3,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 4,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 5,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 6,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 7,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 8,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 9,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 3,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 4,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 5,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 6,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 7,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 8,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 9,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 6,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 7,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 6,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        ),
        article.copy(
            id = 7,
            title = "Название статьи",
            author = "Полля Рыжова",
            date = "16/08/22",
            imageId = R.drawable.food15
        )
    )

    val articleDetails_1 =
        "Гримасы финансового кризиса в России, или Как жить в «эпоху перемен»." +
                "Тема международного финансового кризиса стала нынче очень популярной. В пору говорить о некоей моде – еще бы, на кризис так удобно ссылаться при случае: можно сократить сотрудников, задержать им зарплату, а то и вовсе урезать ее со словами: «ну, вы же понимаете, финансовый кризис в 2008…». Согласно опросу Фонда «Общественное мнение» в феврале нынешнего года это выражение не знал каждый третий россиянин (31%), в сентябре – каждый четвертый (25%), ну, а сейчас о финансовом кризисе не слышали лишь 11% россиян. При этом половина опрошенных считает, что кризис уже наступил, 16% уверены, что он еще впереди, остальные же воздерживаются от каких-либо прогнозов. В целом, отношение к кризису не столько пугливое, сколько любопытное. Всех мучают простые вопросы: кто виноват и что делать, будет ли дефолт вкупе с деноминацией (или наоборот?), забирать ли деньги из банка, в чем хранить сбережения, когда же все это закончится и к чему приведет?" +
                "Кто виноват, или Причины финансового кризиса" +
                "Экономисты единодушны во мнении, что современный финансовый кризис – это прямое следствие кризиса ипотечного кредитования в США (доля данного сектора в экономике страны составляет 1.4%). Частные американские банки настолько вошли в раж в погоне за обогащением, раздавая направо и налево ипотечные кредиты, что в категорию счастливых собственников ипотечного жилья вошли и те американцы, которые были просто не в состоянии регулярно выплачивать проценты по кредитам. В итоге жилье чуть ли не в массовом порядке переходило в собственность банков, а достаточного количества людей, которые бы хотели покупать это жилье, не находилось. Исход подобного положения дел вполне предсказуем: банкротство банков." +
                "Возникает вполне закономерный вопрос: «Как допустили возникновение такой ситуации?». Да все просто: фондовый рынок оккупировали игроки-спекулянты, которые занимались куплей-продажей высокодоходных, но при этом высокорискованных инструментов, создавая финансовые пирамиды. Грубо говоря, они вкладывали 1 доллар, а получали 9, но при этом очень сильно рисковали. Ведь даже небольшое уменьшение стоимости ценных бумаг могло повлечь за собой огромные потери." +
                "В итоге финансовая система США дала сбой – миллиарды и триллионы долларов, которые были задействованы в финансовых операциях повышенного риска, оказались, просто-напросто, неликвидны. «И заверте…»: инвестиционные компании и банки терпят убытки и банкротятся, ухудшая ситуацию и на мировом финансовом рынке. Ведь американская экономика сродни гигантскому спруту, опутавшему своими щупальцами всю планету: филиалы американских корпораций открыты почти во всех странах мира, американский доллар, ценные бумаги США традиционно выступают в качестве финансового гаранта для других стран, которые с их помощью защищаются от различного рода рисков. Поэтому неудивительно, что кризис ипотечного кредитования в США отозвался финансовой «болью» всему миру, и России в том числе." +
                "Финансовый кризис в России: будет дефолт?" +
                "В отличие от оптимистично настроенного Дональда Трампа (ну, а чего ему расстраиваться, миллионеру-то?), который убежден в том, что финансовый кризис будет успешно преодолен, российский народ, на всякий случай, готовится к самому худшему – дефолту. Однако большинство экономистов уверено, что его не будет." +
                "В первую очередь кризис «ударит» (уже «ударяет») по крупным компаниям, ориентированным на экспорт. Это связано со снижением покупательской способности, избытком товаров и дефляцией, а также дефицитом ликвидности предприятий – компании, продукция которых имеет высокую себестоимость, вынуждены останавливать производство, уменьшая потребность в сырьевых ресурсах (а они составляют до 80% экспорта страны, между прочим) и сокращать рабочих, естественно, теряя и заказчиков. Снижается экспорт – замедляется и рост экономики. И все же финансовый кризис в России будет «мягким», по мнению экспертов. Ведь страна владеет (монополист) такими природными ресурсами как нефть и платина."

    val articleDetails_2 =
        "Сейчас все усилия государства направлены на то, чтобы поддержать и оставить на плаву хотя бы системообразующие банки. Между тем, если малые региональные банки, которых на государственном уровне не поддерживают, не смогут «пережить» финансово экономический кризис, то, по мнению большинства экономистов, малый бизнес очень сильно пострадает, что недопустимо, ведь его вклад в экономику страны составляет порядка 20%." +

                "Сохранность вкладов во время мирового финансового кризиса: оставить в банке или положить в банку?" +
                "Самый, пожалуй, животрепещущий вопрос для многих россиян звучит именно так: забирать ли деньги из банка? Это зависит, прежде всего, от «качества» банка: если он участник системы кредитования Центрального банка, то бояться нечего, ведь все вклады до 700 тыс. рублей гарантированно защищаются государством. В любом случае, ажиотаж вокруг финансового кризиса в России уже идет на спад, и острой необходимости забирать свои вклады из банков нет. Дальнейшие действия необходимо предпринимать в соответствии с тем, в какой валюте хранятся сбережения и с какой целью." +
                "И вот здесь уже ни один эксперт не берется помочь: курсы евро, доллара, рубля, йены и юаня настолько непредсказуемы, что делать прогнозы сродни тыканью пальцем в небо. Поэтому специалисты высказываются несколько туманно и обобщенно, предлагая хранить свои сбережения в той же валюте, в которой планируется их потратить. А можно пропорционально разделить имеющиеся средства и хранить их в нескольких валютах – рублях, долларах, евро и швейцарских франках, к примеру, либо вообще купить на все сбережения золото." +
                "Финансовый кризис 2009 и недвижимость, или «Когда же закончится это безобразие!»" +
                "Вот уж точно, во что не надо инвестировать во время мирового финансового кризиса, так это в недвижимость, особенно участвовать в долевом строительстве, ведь сдача новостройки в условиях наступившего кризиса может затянуться на годы. Имеющим кредит можно не спешить в банк для досрочного возвращения денег, а лучше стараться в срок выплачивать то, что положено и не портить свою кредитную историю. С другой стороны, если в договоре с банком прописана возможность увеличения ставки по кредиту, а вы располагаете необходимыми средствами, чтобы погасит займ досрочно, то лучше всего так и поступить." +
                "Прогнозов «кончины» финансового кризиса много: кто-то предрекает скорый крах финансовой системы всего мира, а кто-то верит в лучшее, предсказывая, что кризис благополучно «рассосется», продержавшись до весны следующего года максимум. Окончание кризиса будет заметно по тому, что банки снова станут выдавать кредиты, постепенно увеличивая их срок и снижая процентную ставку. Пока же, несмотря на усилия правительства, развитие финансового кризиса в России продолжается, так сказать, своим чередом: фондовые биржи и банки лихорадит, инвестиционная деятельность приостановлена, наблюдаются массовые увольнения, и цены на нефть грозят резким снижением…" +
                "Как пережить финансовый кризис?" +
                "Чтобы пережить финансовый кризис с минимальными потерями, экономисты советуют:" +
                "Перевести свои вклады из мелких банков в крупные государственные, защищенные государственными гарантиями." +
                "Урезать расходы на товары не первой необходимости." +
                "Создать собственный «стабилизационный» фонд для непредвиденных расходов, пополняя его по мере возможности. В трудную минуту (тьфу-тьфу!) «копилочные» деньги станут неоценимым подспорьем." +
                "Отказаться от неиспользуемых услуг, за которые идет ежемесячная оплата (например, пакет ночных кабельных каналов и т. д. – вроде и недорого, но в условиях кризиса важна любая экономия)." +
                "Не одалживать деньги, особенно под проценты." +
                "Ежемесячно откладывать часть средств «на пенсию»." +
                "Изучить налоговую «матчасть» - может оказаться, что вам должны возмещать какие-либо налоги (например, при расходах на обучение), но не делают этого, а вы и не в курсе." +
                "Договориться с банком об отсрочке кредита и с выгодой воспользоваться свободными денежными средствами. Ведь известно, что инвестиции во время кризиса или сразу после него – одни из самых выгодных. Правда, угадать, во что вкладывать деньги сейчас, чтобы получить прибыль потом, сложно." +
                "Главное помнить, что никакой кризис не может длиться вечно – «неприятность эту мы переживем!»"

}

